{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "input_dtype": "float32", "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_1", "axis": -1}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "bias": true, "name": "convolution2d_1", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 24, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_2", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_1", "alpha": 0.3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "bias": true, "name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 36, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_3", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_2", "alpha": 0.3}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "bias": true, "name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 48, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_4", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_3", "alpha": 0.3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "bias": true, "name": "convolution2d_4", "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 56, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_5", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_4", "alpha": 0.3}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "bias": true, "name": "convolution2d_5", "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_6", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_5", "alpha": 0.3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "output_dim": 100, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_1"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_7", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_6", "alpha": 0.3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "output_dim": 50, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_8", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_7", "alpha": 0.3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_9", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_8", "alpha": 0.3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_4"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_10", "axis": -1}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "keras_version": "1.1.1"}